import re

#Task 1
text = "Как же это бесит, когда кто-то... Лезет с хамством и злобой? Сердце разрывается от несправедливости. Но хватит! Пусть все эти редиски и нехорошие люди исчезнут!! Хочется наконец тепла и улыбок??? Давайте жить дружно — вот единственное спасение от всей этой дурацкой злости."
result = re.split(r'[.?!]+', text)
for i in result:
    print(i.strip())

#Task 2
text_task2 = "Однажды я вырастил на грядке большую красную редиску. Но пришёл сосед — настоящий нехороший человек. Этот нехороший человек выдернул мою редиску и съел. Я говорю: «Ты просто редиска, а не человек!» А он смеётся: «Редиска — это вкусно, а вот ты — нехороший человек, потому что обзываешься». Так мы и расстались: я без редиски, а он — нехороший человек при редиске."

result_rediska = re.sub(r'редиск\w+', "*давайте жить дружно*", text_task2)
result_task2 = re.sub(r'нехорош\w+\s+челов\w+', "*давайте жить дружно*", result_rediska)
print(result_task2)