
regions = [
    [
        "Архангельск",
        "Новодвинск",
        "Северодвинск",
        "Шенкурск",
        "Котлас",
        "Карпогоры"
    ],
    [
        "Санкт-Петербург",
        "Пушкин",
        "Павловск"
    ]
]

n = int(input("Количество городов: "))

while n > 0:
    city = input("Введите город: ")
    if city in regions[0]:
        print("Архангельская область")
    elif city in regions[1]:
        print("Ленинградская область")
    else:
        print("Никого не найдено")
    n-=1